{
  "id": "twinleaf_town_bedroom",
  "name": "Bedroom",
  "root": true,
  "music": "twinleaf_town_loop",
  "actions": [
    { "label": "Head downstairs", "type": "move", "target": "twinleaf_town_home_interior" },
    { "label": "Look at Wii", "type": "inspect", "text": "It's a Wii. The system is a little dusty but still works." },
  { "label": "Look at clock", "type": "inspect", "text": "You adjust the clock. The hands whirl then settle. It's currently {SYSTEM_TIME}!", "set_flag": "clock_synced" },
  { 
    "label": "Watch TV", 
    "type": "inspect", 
    "text": {
      "monday": "You turn on the TV. It's \"Professor Oak's Pokémon Talk!\"\nPROFESSOR OAK: Welcome, trainers! Today we're discussing the fascinating world of Grass-type Pokémon.\nDid you know that Grass-types are particularly effective against Water, Ground, and Rock-types?\nTheir photosynthetic abilities allow them to heal during sunny weather conditions.\nMany Grass-types develop beautiful flowers or leaves that can be used in various medicines.\nRemember, young trainers: understanding type matchups is crucial for becoming a Pokémon Master!\nThat's all for today's episode. Keep exploring and keep learning!",
      "tuesday": "You flip to Channel 7. \"Nurse Joy's Health Corner\" is on!\nNURSE JOY: Good evening, everyone! Tonight we're talking about Pokémon nutrition and care.\nDid you know that different Pokémon types require different dietary needs?\nFire-types often need foods rich in sulfur and magnesium to maintain their internal flames.\nWater-types benefit from a diet high in minerals found in seaweed and algae.\nRegular check-ups at your local Pokémon Center ensure your partners stay in top condition.\nRemember: a healthy Pokémon is a happy Pokémon!\nSee you next week for more health tips!",
      "wednesday": "The TV shows \"Champion Cynthia's Battle Strategies.\"\nCYNTHIA: Greetings, aspiring trainers. Today we'll explore advanced battle techniques.\nType advantages are just the beginning - true strategy involves predicting your opponent's moves.\nConsider your Pokémon's abilities, not just their types, when planning your approach.\nSometimes the unexpected move can turn the tide of an entire battle.\nBuilding trust with your team is more valuable than any single powerful attack.\nA coordinator's grace combined with a trainer's strategy creates unstoppable combinations.\nTrain hard, think harder, and never underestimate any opponent.",
      "thursday": "You tune in to \"Pokémon Ranger Adventures\" on Channel 3.\nRANGER: Today we're exploring the mysterious relationship between Pokémon and their natural habitats.\nDeep in Eterna Forest, we've discovered Pokémon creating intricate symbiotic relationships.\nGrass-types help maintain the forest's ecosystem while Bug-types aid in pollination.\nThese partnerships have existed for thousands of years, long before humans arrived.\nProtecting these natural habitats ensures future generations can witness these amazing bonds.\nRemember: we share this world with Pokémon, and it's our duty to preserve it.\nUntil next time, keep exploring responsibly!",
      "friday": "\"Contest Coordinator Weekly\" is playing on the entertainment channel.\nCOORDINATOR: Welcome to this week's showcase of the most dazzling Contest performances!\nTonight we're featuring stunning combinations using Fire and Electric-type moves.\nWatch as this Rapidash creates spiraling flames that dance with Raichu's electric sparks!\nThe judges are looking for creativity, timing, and the bond between coordinator and Pokémon.\nRemember, contests aren't just about power - they're about artistry and expression.\nNext week we'll feature Water-type elegance performances from Hearthome City.\nKeep practicing those combinations, coordinators!",
      "saturday": "You switch to \"Pokémon Myths and Legends\" on the documentary channel.\nNARRATOR: Tonight we explore the ancient legends of Sinnoh's legendary Pokémon.\nDeep beneath Mount Coronet lies the Hall of Origin, said to be Arceus's resting place.\nLocal folklore speaks of Dialga and Palkia, masters of time and space respectively.\nThese powerful beings supposedly shaped our very reality eons ago.\nSome believe the Lake Guardians - Azelf, Mesprit, and Uxie - granted humans emotion and knowledge.\nWhile scientists debate these tales, the mystery continues to captivate researchers worldwide.\nPerhaps some legends are best left as beautiful mysteries.",
      "sunday": "The Sunday comedy show \"Team Rocket's Blast-Off Blunders\" is starting.\nJESSE: Prepare for trouble, and make it double!\nJAMES: Today we're demonstrating our newest Pokémon-catching contraption!\nMEOWTH: Dis thing's gonna make us rich, or my name ain't Meowth!\n*BOOM!* The machine explodes spectacularly, launching Team Rocket into the sky.\nTEAM ROCKET: We're blasting off again!\nCOMEDY HOST: And that concludes another episode of everyone's favorite comedy trio!\nTune in next week for more hilarious mishaps and mechanical mayhem!"
    }
  },
  { "label": "Take rest on bed", "type": "rest", "text": "z... z... z", "set_flag": "took_rest_bedroom" },
    { "label": "Return to Main Menu", "type": "exit" }
  ],
  "children": ["twinleaf_town_home_interior"]
}
