{
  "_meta": { "phase": 1, "segment": "pre_gym1" },
  "tutorial.catch.intro": {
    "expanded": "Alright, sharp—I'll show you exactly how to weaken and then safely catch a wild Pokémon.",
    "base": "Watch—how to weaken then catch a wild Pokémon.",
    "concise": "Watch me catch one.",
    "speaker": "dawn"
  },
  "tutorial.catch.outro": {
    "expanded": "And that's the flow: soften it up, maybe inflict a status condition, then throw the right Poké Ball for a clean capture.",
    "base": "So: weaken, maybe status, then the right Poké Ball.",
    "concise": "Weaken, maybe status, ball.",
    "speaker": "dawn"
  },
  "quest.parcel.find_rival": {
    "expanded": "{RIVAL}: Hey, you made it {PLAYER}! I've been buzzing with curiosity—do you have that parcel they said you'd bring?",
    "speaker": "rival"
  },
  "quest.parcel.delivery": {
    "expanded": "{RIVAL}: Whoa, a Town Map! Perfect—we can plot routes faster and never waste steps.",
    "speaker": "rival"
  },
  "poketch.clown1.quiz": {
    "expanded": "Correct! Pokémon grow stronger by gaining experience in battle. Here's your first coupon!",
    "speaker": "announcer"
  },
  "poketch.clown2.quiz": {
    "expanded": "Exactly! A Pokémon can hold a single item—choose tactically. Accept this second coupon!",
    "speaker": "announcer"
  },
  "poketch.clown3.quiz": {
    "expanded": "Spot on! Matching move types boosts damage. Here's your final coupon!",
    "speaker": "announcer"
  },
  "poketch.president.award": {
    "expanded": "Marvelous! You've collected all three coupons, so I proudly present you with this cutting-edge Pokétch!",
    "speaker": "announcer"
  },
  "rival2.prep": {
    "expanded": "{RIVAL}: Time for a skill check—you've trained, I've trained—let's see whose team adapted better, {PLAYER}!",
    "base": "{RIVAL}: Skill check—whose team grew more, {PLAYER}?",
    "concise": "{RIVAL}: Battle time, {PLAYER}!",
    "speaker": "rival"
  },
  "rival2.after": {
    "expanded": "{RIVAL}: Whew—that gap's still there. I'm doubling my training—next time, I'll flip the script!",
    "base": "{RIVAL}: Still behind… I'll train harder!",
    "concise": "{RIVAL}: I'll catch up!",
    "speaker": "rival"
  },
  "hm.rock_smash.give": {
    "expanded": "Here—HM Rock Smash. With the right Badge, your Pokémon can pulverize small boulders blocking paths.",
    "speaker": "announcer"
  },
  "roark.demo.intro": {
    "expanded": "You're just in time—observe how a seasoned Rock-type Trainer handles obstacles efficiently!",
    "speaker": "roark"
  },
  "roark.demo.outro": {
    "expanded": "That should clear your path. Head back to the Gym; I'll prep the field for our match!",
    "speaker": "roark"
  },
  "gym1.intro": {
    "expanded": "Now—demonstrate the strength of the bond you've forged with your Pokémon!",
    "speaker": "roark"
  },
  "gym1.victory": {
    "expanded": "Outstanding performance! Take the Coal Badge—and may it solidify your path forward!",
    "speaker": "roark"
  },
  "sandgem.rowan.lab.intro": {
    "expanded": "You arrived sooner than expected. You handled that borrowed Pokémon with notable care—commendable.",
    "speaker": "prof"
  },
  "sandgem.assistant.waiting": {
    "expanded": "Oh! There you are! I've been waiting for you.",
    "speaker": "dawn"
  },
  "sandgem.assistant.to_lab": {
    "expanded": "Come with me! Professor Rowan wants to see you right away.",
    "speaker": "dawn"
  },
  "sandgem.rowan.rival.leaving": {
    "expanded": "As you approach the lab, you see Professor Rowan escorting your frustrated rival outside. Barry looks pretty upset about something...",
    "speaker": "narrator"
  },
  "sandgem.rowan.pokemon.happiness": {
    "expanded": "Ah, there you are! Let me have a look at that Pokémon I lent you... Wonderful! I can see it's very happy with you. That's exactly what I was hoping to see.",
    "speaker": "prof"
  },
  "sandgem.rowan.keep.partner": {
    "expanded": "If you continue to nurture it responsibly, I see no harm in you keeping that Pokémon as your partner.",
    "speaker": "prof"
  },
  "sandgem.rowan.pokedex.offer": {
    "expanded": "Since you and this Pokémon have bonded so well, I'd like you to help me with my research. Would you be willing to travel through Sinnoh and document the Pokémon you encounter?",
    "speaker": "prof"
  },
  "sandgem.rowan.pokedex.give": {
    "expanded": "Excellent! This is a Pokédex - it automatically records data about any Pokémon you see or catch. It will be invaluable for both your journey and my research.",
    "speaker": "prof"
  },
  "sandgem.rowan.tm27.give": {
    "expanded": "One more thing before you go - please take this TM27. It contains the move Return, which grows stronger the more your Pokémon trusts you. Remember, TMs can only be used once!",
    "speaker": "prof"
  },
  "sandgem.assistant.tour.start": {
    "expanded": "Now that you have a Pokédex, your real adventure can begin! But first, let me show you around town.",
    "speaker": "dawn"
  },
  "sandgem.assistant.tour.center": {
    "expanded": "This is the Pokémon Center - you'll find one in almost every town. They'll heal your Pokémon for free, and the staff often have helpful information. Always visit the Pokémon Center first when you reach a new place!",
    "speaker": "dawn"
  },
  "sandgem.assistant.tour.mart": {
    "expanded": "And this is the Poké Mart - your one-stop shop for supplies! Most marts have two cashiers: the right one sells standard items, while the left one usually has local specialties. Your selection will grow as you earn more Gym Badges!",
    "speaker": "dawn"
  },
  "sandgem.assistant.tour.finish": {
    "expanded": "Oh, and don't forget to visit your mom before you head out on your journey! Also, see that path south of town? It leads to the ocean, but you'll need a Pokémon that knows Surf to explore those waters. Save it for later!",
    "speaker": "dawn"
  },
  "twinleaf.mom.react.pokedex": {
    "expanded": "A Pokédex already? That's remarkable. Your adventure begins in earnest now.",
    "speaker": "mom"
  },
  "twinleaf.mom.give.running_shoes": {
    "expanded": "Here—Running Shoes. Hold them to move with purpose; don't squander daylight.",
    "speaker": "mom"
  }
}